{"class_name": "Model", "keras_version": "2.1.6", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 5, 13, 13], "name": "inputs_board", "sparse": false}, "inbound_nodes": [], "name": "inputs_board"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "initial-conv", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["inputs_board", 0, 0, {}]]], "name": "initial-conv"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_0_bn_1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["initial-conv", 0, 0, {}]]], "name": "ResLayer_0_bn_1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "ResLayer_0_act_1"}, "inbound_nodes": [[["ResLayer_0_bn_1", 0, 0, {}]]], "name": "ResLayer_0_act_1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_0_conv1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["ResLayer_0_act_1", 0, 0, {}]]], "name": "ResLayer_0_conv1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_0_bn_2", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_0_conv1", 0, 0, {}]]], "name": "ResLayer_0_bn_2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "ResLayer_0_act_2"}, "inbound_nodes": [[["ResLayer_0_bn_2", 0, 0, {}]]], "name": "ResLayer_0_act_2"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_0_conv2", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["ResLayer_0_act_2", 0, 0, {}]]], "name": "ResLayer_0_conv2"}, {"class_name": "GlobalAveragePooling2D", "config": {"trainable": true, "name": "ResLayer_0_se_average", "data_format": "channels_first"}, "inbound_nodes": [[["ResLayer_0_conv2", 0, 0, {}]]], "name": "ResLayer_0_se_average"}, {"class_name": "Reshape", "config": {"target_shape": [1, 1, 96], "trainable": true, "name": "ResLayer_0_reshape"}, "inbound_nodes": [[["ResLayer_0_se_average", 0, 0, {}]]], "name": "ResLayer_0_reshape"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "ResLayer_0_se_compress", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": false, "activity_regularizer": null}, "inbound_nodes": [[["ResLayer_0_reshape", 0, 0, {}]]], "name": "ResLayer_0_se_compress"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "ResLayer_0_se_gating", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 96, "use_bias": false, "activity_regularizer": null}, "inbound_nodes": [[["ResLayer_0_se_compress", 0, 0, {}]]], "name": "ResLayer_0_se_gating"}, {"class_name": "Permute", "config": {"dims": [3, 1, 2], "trainable": true, "name": "ResLayer_0_se_permute"}, "inbound_nodes": [[["ResLayer_0_se_gating", 0, 0, {}]]], "name": "ResLayer_0_se_permute"}, {"class_name": "Multiply", "config": {"trainable": true, "name": "ResLayer_0_se_scale"}, "inbound_nodes": [[["ResLayer_0_conv2", 0, 0, {}], ["ResLayer_0_se_permute", 0, 0, {}]]], "name": "ResLayer_0_se_scale"}, {"class_name": "Add", "config": {"trainable": true, "name": "ResLayer_0_add"}, "inbound_nodes": [[["initial-conv", 0, 0, {}], ["ResLayer_0_se_scale", 0, 0, {}]]], "name": "ResLayer_0_add"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_1_bn_1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_0_add", 0, 0, {}]]], "name": "ResLayer_1_bn_1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "ResLayer_1_act_1"}, "inbound_nodes": [[["ResLayer_1_bn_1", 0, 0, {}]]], "name": "ResLayer_1_act_1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_1_conv1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["ResLayer_1_act_1", 0, 0, {}]]], "name": "ResLayer_1_conv1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_1_bn_2", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_1_conv1", 0, 0, {}]]], "name": "ResLayer_1_bn_2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "ResLayer_1_act_2"}, "inbound_nodes": [[["ResLayer_1_bn_2", 0, 0, {}]]], "name": "ResLayer_1_act_2"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_1_conv2", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["ResLayer_1_act_2", 0, 0, {}]]], "name": "ResLayer_1_conv2"}, {"class_name": "GlobalAveragePooling2D", "config": {"trainable": true, "name": "ResLayer_1_se_average", "data_format": "channels_first"}, "inbound_nodes": [[["ResLayer_1_conv2", 0, 0, {}]]], "name": "ResLayer_1_se_average"}, {"class_name": "Reshape", "config": {"target_shape": [1, 1, 96], "trainable": true, "name": "ResLayer_1_reshape"}, "inbound_nodes": [[["ResLayer_1_se_average", 0, 0, {}]]], "name": "ResLayer_1_reshape"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "ResLayer_1_se_compress", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": false, "activity_regularizer": null}, "inbound_nodes": [[["ResLayer_1_reshape", 0, 0, {}]]], "name": "ResLayer_1_se_compress"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "ResLayer_1_se_gating", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 96, "use_bias": false, "activity_regularizer": null}, "inbound_nodes": [[["ResLayer_1_se_compress", 0, 0, {}]]], "name": "ResLayer_1_se_gating"}, {"class_name": "Permute", "config": {"dims": [3, 1, 2], "trainable": true, "name": "ResLayer_1_se_permute"}, "inbound_nodes": [[["ResLayer_1_se_gating", 0, 0, {}]]], "name": "ResLayer_1_se_permute"}, {"class_name": "Multiply", "config": {"trainable": true, "name": "ResLayer_1_se_scale"}, "inbound_nodes": [[["ResLayer_1_conv2", 0, 0, {}], ["ResLayer_1_se_permute", 0, 0, {}]]], "name": "ResLayer_1_se_scale"}, {"class_name": "Add", "config": {"trainable": true, "name": "ResLayer_1_add"}, "inbound_nodes": [[["ResLayer_0_add", 0, 0, {}], ["ResLayer_1_se_scale", 0, 0, {}]]], "name": "ResLayer_1_add"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_2_bn_1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_1_add", 0, 0, {}]]], "name": "ResLayer_2_bn_1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "ResLayer_2_act_1"}, "inbound_nodes": [[["ResLayer_2_bn_1", 0, 0, {}]]], "name": "ResLayer_2_act_1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_2_conv1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["ResLayer_2_act_1", 0, 0, {}]]], "name": "ResLayer_2_conv1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_2_bn_2", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_2_conv1", 0, 0, {}]]], "name": "ResLayer_2_bn_2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "ResLayer_2_act_2"}, "inbound_nodes": [[["ResLayer_2_bn_2", 0, 0, {}]]], "name": "ResLayer_2_act_2"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_2_conv2", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["ResLayer_2_act_2", 0, 0, {}]]], "name": "ResLayer_2_conv2"}, {"class_name": "GlobalAveragePooling2D", "config": {"trainable": true, "name": "ResLayer_2_se_average", "data_format": "channels_first"}, "inbound_nodes": [[["ResLayer_2_conv2", 0, 0, {}]]], "name": "ResLayer_2_se_average"}, {"class_name": "Reshape", "config": {"target_shape": [1, 1, 96], "trainable": true, "name": "ResLayer_2_reshape"}, "inbound_nodes": [[["ResLayer_2_se_average", 0, 0, {}]]], "name": "ResLayer_2_reshape"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "ResLayer_2_se_compress", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": false, "activity_regularizer": null}, "inbound_nodes": [[["ResLayer_2_reshape", 0, 0, {}]]], "name": "ResLayer_2_se_compress"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "ResLayer_2_se_gating", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 96, "use_bias": false, "activity_regularizer": null}, "inbound_nodes": [[["ResLayer_2_se_compress", 0, 0, {}]]], "name": "ResLayer_2_se_gating"}, {"class_name": "Permute", "config": {"dims": [3, 1, 2], "trainable": true, "name": "ResLayer_2_se_permute"}, "inbound_nodes": [[["ResLayer_2_se_gating", 0, 0, {}]]], "name": "ResLayer_2_se_permute"}, {"class_name": "Multiply", "config": {"trainable": true, "name": "ResLayer_2_se_scale"}, "inbound_nodes": [[["ResLayer_2_conv2", 0, 0, {}], ["ResLayer_2_se_permute", 0, 0, {}]]], "name": "ResLayer_2_se_scale"}, {"class_name": "Add", "config": {"trainable": true, "name": "ResLayer_2_add"}, "inbound_nodes": [[["ResLayer_1_add", 0, 0, {}], ["ResLayer_2_se_scale", 0, 0, {}]]], "name": "ResLayer_2_add"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_3_bn_1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_2_add", 0, 0, {}]]], "name": "ResLayer_3_bn_1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "ResLayer_3_act_1"}, "inbound_nodes": [[["ResLayer_3_bn_1", 0, 0, {}]]], "name": "ResLayer_3_act_1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_3_conv1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["ResLayer_3_act_1", 0, 0, {}]]], "name": "ResLayer_3_conv1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_3_bn_2", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_3_conv1", 0, 0, {}]]], "name": "ResLayer_3_bn_2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "ResLayer_3_act_2"}, "inbound_nodes": [[["ResLayer_3_bn_2", 0, 0, {}]]], "name": "ResLayer_3_act_2"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_3_conv2", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["ResLayer_3_act_2", 0, 0, {}]]], "name": "ResLayer_3_conv2"}, {"class_name": "GlobalAveragePooling2D", "config": {"trainable": true, "name": "ResLayer_3_se_average", "data_format": "channels_first"}, "inbound_nodes": [[["ResLayer_3_conv2", 0, 0, {}]]], "name": "ResLayer_3_se_average"}, {"class_name": "Reshape", "config": {"target_shape": [1, 1, 96], "trainable": true, "name": "ResLayer_3_reshape"}, "inbound_nodes": [[["ResLayer_3_se_average", 0, 0, {}]]], "name": "ResLayer_3_reshape"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "ResLayer_3_se_compress", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": false, "activity_regularizer": null}, "inbound_nodes": [[["ResLayer_3_reshape", 0, 0, {}]]], "name": "ResLayer_3_se_compress"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "ResLayer_3_se_gating", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 96, "use_bias": false, "activity_regularizer": null}, "inbound_nodes": [[["ResLayer_3_se_compress", 0, 0, {}]]], "name": "ResLayer_3_se_gating"}, {"class_name": "Permute", "config": {"dims": [3, 1, 2], "trainable": true, "name": "ResLayer_3_se_permute"}, "inbound_nodes": [[["ResLayer_3_se_gating", 0, 0, {}]]], "name": "ResLayer_3_se_permute"}, {"class_name": "Multiply", "config": {"trainable": true, "name": "ResLayer_3_se_scale"}, "inbound_nodes": [[["ResLayer_3_conv2", 0, 0, {}], ["ResLayer_3_se_permute", 0, 0, {}]]], "name": "ResLayer_3_se_scale"}, {"class_name": "Add", "config": {"trainable": true, "name": "ResLayer_3_add"}, "inbound_nodes": [[["ResLayer_2_add", 0, 0, {}], ["ResLayer_3_se_scale", 0, 0, {}]]], "name": "ResLayer_3_add"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_4_bn_1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_3_add", 0, 0, {}]]], "name": "ResLayer_4_bn_1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "ResLayer_4_act_1"}, "inbound_nodes": [[["ResLayer_4_bn_1", 0, 0, {}]]], "name": "ResLayer_4_act_1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_4_conv1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["ResLayer_4_act_1", 0, 0, {}]]], "name": "ResLayer_4_conv1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_4_bn_2", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_4_conv1", 0, 0, {}]]], "name": "ResLayer_4_bn_2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "ResLayer_4_act_2"}, "inbound_nodes": [[["ResLayer_4_bn_2", 0, 0, {}]]], "name": "ResLayer_4_act_2"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_4_conv2", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["ResLayer_4_act_2", 0, 0, {}]]], "name": "ResLayer_4_conv2"}, {"class_name": "GlobalAveragePooling2D", "config": {"trainable": true, "name": "ResLayer_4_se_average", "data_format": "channels_first"}, "inbound_nodes": [[["ResLayer_4_conv2", 0, 0, {}]]], "name": "ResLayer_4_se_average"}, {"class_name": "Reshape", "config": {"target_shape": [1, 1, 96], "trainable": true, "name": "ResLayer_4_reshape"}, "inbound_nodes": [[["ResLayer_4_se_average", 0, 0, {}]]], "name": "ResLayer_4_reshape"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "ResLayer_4_se_compress", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": false, "activity_regularizer": null}, "inbound_nodes": [[["ResLayer_4_reshape", 0, 0, {}]]], "name": "ResLayer_4_se_compress"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "ResLayer_4_se_gating", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 96, "use_bias": false, "activity_regularizer": null}, "inbound_nodes": [[["ResLayer_4_se_compress", 0, 0, {}]]], "name": "ResLayer_4_se_gating"}, {"class_name": "Permute", "config": {"dims": [3, 1, 2], "trainable": true, "name": "ResLayer_4_se_permute"}, "inbound_nodes": [[["ResLayer_4_se_gating", 0, 0, {}]]], "name": "ResLayer_4_se_permute"}, {"class_name": "Multiply", "config": {"trainable": true, "name": "ResLayer_4_se_scale"}, "inbound_nodes": [[["ResLayer_4_conv2", 0, 0, {}], ["ResLayer_4_se_permute", 0, 0, {}]]], "name": "ResLayer_4_se_scale"}, {"class_name": "Add", "config": {"trainable": true, "name": "ResLayer_4_add"}, "inbound_nodes": [[["ResLayer_3_add", 0, 0, {}], ["ResLayer_4_se_scale", 0, 0, {}]]], "name": "ResLayer_4_add"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_5_bn_1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_4_add", 0, 0, {}]]], "name": "ResLayer_5_bn_1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "ResLayer_5_act_1"}, "inbound_nodes": [[["ResLayer_5_bn_1", 0, 0, {}]]], "name": "ResLayer_5_act_1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_5_conv1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["ResLayer_5_act_1", 0, 0, {}]]], "name": "ResLayer_5_conv1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_5_bn_2", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_5_conv1", 0, 0, {}]]], "name": "ResLayer_5_bn_2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "ResLayer_5_act_2"}, "inbound_nodes": [[["ResLayer_5_bn_2", 0, 0, {}]]], "name": "ResLayer_5_act_2"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_5_conv2", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["ResLayer_5_act_2", 0, 0, {}]]], "name": "ResLayer_5_conv2"}, {"class_name": "GlobalAveragePooling2D", "config": {"trainable": true, "name": "ResLayer_5_se_average", "data_format": "channels_first"}, "inbound_nodes": [[["ResLayer_5_conv2", 0, 0, {}]]], "name": "ResLayer_5_se_average"}, {"class_name": "Reshape", "config": {"target_shape": [1, 1, 96], "trainable": true, "name": "ResLayer_5_reshape"}, "inbound_nodes": [[["ResLayer_5_se_average", 0, 0, {}]]], "name": "ResLayer_5_reshape"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "ResLayer_5_se_compress", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": false, "activity_regularizer": null}, "inbound_nodes": [[["ResLayer_5_reshape", 0, 0, {}]]], "name": "ResLayer_5_se_compress"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "ResLayer_5_se_gating", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 96, "use_bias": false, "activity_regularizer": null}, "inbound_nodes": [[["ResLayer_5_se_compress", 0, 0, {}]]], "name": "ResLayer_5_se_gating"}, {"class_name": "Permute", "config": {"dims": [3, 1, 2], "trainable": true, "name": "ResLayer_5_se_permute"}, "inbound_nodes": [[["ResLayer_5_se_gating", 0, 0, {}]]], "name": "ResLayer_5_se_permute"}, {"class_name": "Multiply", "config": {"trainable": true, "name": "ResLayer_5_se_scale"}, "inbound_nodes": [[["ResLayer_5_conv2", 0, 0, {}], ["ResLayer_5_se_permute", 0, 0, {}]]], "name": "ResLayer_5_se_scale"}, {"class_name": "Add", "config": {"trainable": true, "name": "ResLayer_5_add"}, "inbound_nodes": [[["ResLayer_4_add", 0, 0, {}], ["ResLayer_5_se_scale", 0, 0, {}]]], "name": "ResLayer_5_add"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_6_bn_1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_5_add", 0, 0, {}]]], "name": "ResLayer_6_bn_1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "ResLayer_6_act_1"}, "inbound_nodes": [[["ResLayer_6_bn_1", 0, 0, {}]]], "name": "ResLayer_6_act_1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_6_conv1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["ResLayer_6_act_1", 0, 0, {}]]], "name": "ResLayer_6_conv1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_6_bn_2", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_6_conv1", 0, 0, {}]]], "name": "ResLayer_6_bn_2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "ResLayer_6_act_2"}, "inbound_nodes": [[["ResLayer_6_bn_2", 0, 0, {}]]], "name": "ResLayer_6_act_2"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_6_conv2", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["ResLayer_6_act_2", 0, 0, {}]]], "name": "ResLayer_6_conv2"}, {"class_name": "GlobalAveragePooling2D", "config": {"trainable": true, "name": "ResLayer_6_se_average", "data_format": "channels_first"}, "inbound_nodes": [[["ResLayer_6_conv2", 0, 0, {}]]], "name": "ResLayer_6_se_average"}, {"class_name": "Reshape", "config": {"target_shape": [1, 1, 96], "trainable": true, "name": "ResLayer_6_reshape"}, "inbound_nodes": [[["ResLayer_6_se_average", 0, 0, {}]]], "name": "ResLayer_6_reshape"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "ResLayer_6_se_compress", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": false, "activity_regularizer": null}, "inbound_nodes": [[["ResLayer_6_reshape", 0, 0, {}]]], "name": "ResLayer_6_se_compress"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "ResLayer_6_se_gating", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 96, "use_bias": false, "activity_regularizer": null}, "inbound_nodes": [[["ResLayer_6_se_compress", 0, 0, {}]]], "name": "ResLayer_6_se_gating"}, {"class_name": "Permute", "config": {"dims": [3, 1, 2], "trainable": true, "name": "ResLayer_6_se_permute"}, "inbound_nodes": [[["ResLayer_6_se_gating", 0, 0, {}]]], "name": "ResLayer_6_se_permute"}, {"class_name": "Multiply", "config": {"trainable": true, "name": "ResLayer_6_se_scale"}, "inbound_nodes": [[["ResLayer_6_conv2", 0, 0, {}], ["ResLayer_6_se_permute", 0, 0, {}]]], "name": "ResLayer_6_se_scale"}, {"class_name": "Add", "config": {"trainable": true, "name": "ResLayer_6_add"}, "inbound_nodes": [[["ResLayer_5_add", 0, 0, {}], ["ResLayer_6_se_scale", 0, 0, {}]]], "name": "ResLayer_6_add"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_7_bn_1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_6_add", 0, 0, {}]]], "name": "ResLayer_7_bn_1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "ResLayer_7_act_1"}, "inbound_nodes": [[["ResLayer_7_bn_1", 0, 0, {}]]], "name": "ResLayer_7_act_1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_7_conv1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["ResLayer_7_act_1", 0, 0, {}]]], "name": "ResLayer_7_conv1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_7_bn_2", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_7_conv1", 0, 0, {}]]], "name": "ResLayer_7_bn_2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "ResLayer_7_act_2"}, "inbound_nodes": [[["ResLayer_7_bn_2", 0, 0, {}]]], "name": "ResLayer_7_act_2"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_7_conv2", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["ResLayer_7_act_2", 0, 0, {}]]], "name": "ResLayer_7_conv2"}, {"class_name": "GlobalAveragePooling2D", "config": {"trainable": true, "name": "ResLayer_7_se_average", "data_format": "channels_first"}, "inbound_nodes": [[["ResLayer_7_conv2", 0, 0, {}]]], "name": "ResLayer_7_se_average"}, {"class_name": "Reshape", "config": {"target_shape": [1, 1, 96], "trainable": true, "name": "ResLayer_7_reshape"}, "inbound_nodes": [[["ResLayer_7_se_average", 0, 0, {}]]], "name": "ResLayer_7_reshape"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "ResLayer_7_se_compress", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": false, "activity_regularizer": null}, "inbound_nodes": [[["ResLayer_7_reshape", 0, 0, {}]]], "name": "ResLayer_7_se_compress"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "ResLayer_7_se_gating", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 96, "use_bias": false, "activity_regularizer": null}, "inbound_nodes": [[["ResLayer_7_se_compress", 0, 0, {}]]], "name": "ResLayer_7_se_gating"}, {"class_name": "Permute", "config": {"dims": [3, 1, 2], "trainable": true, "name": "ResLayer_7_se_permute"}, "inbound_nodes": [[["ResLayer_7_se_gating", 0, 0, {}]]], "name": "ResLayer_7_se_permute"}, {"class_name": "Multiply", "config": {"trainable": true, "name": "ResLayer_7_se_scale"}, "inbound_nodes": [[["ResLayer_7_conv2", 0, 0, {}], ["ResLayer_7_se_permute", 0, 0, {}]]], "name": "ResLayer_7_se_scale"}, {"class_name": "Add", "config": {"trainable": true, "name": "ResLayer_7_add"}, "inbound_nodes": [[["ResLayer_6_add", 0, 0, {}], ["ResLayer_7_se_scale", 0, 0, {}]]], "name": "ResLayer_7_add"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_8_bn_1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_7_add", 0, 0, {}]]], "name": "ResLayer_8_bn_1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "ResLayer_8_act_1"}, "inbound_nodes": [[["ResLayer_8_bn_1", 0, 0, {}]]], "name": "ResLayer_8_act_1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_8_conv1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["ResLayer_8_act_1", 0, 0, {}]]], "name": "ResLayer_8_conv1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_8_bn_2", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_8_conv1", 0, 0, {}]]], "name": "ResLayer_8_bn_2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "ResLayer_8_act_2"}, "inbound_nodes": [[["ResLayer_8_bn_2", 0, 0, {}]]], "name": "ResLayer_8_act_2"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_8_conv2", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["ResLayer_8_act_2", 0, 0, {}]]], "name": "ResLayer_8_conv2"}, {"class_name": "GlobalAveragePooling2D", "config": {"trainable": true, "name": "ResLayer_8_se_average", "data_format": "channels_first"}, "inbound_nodes": [[["ResLayer_8_conv2", 0, 0, {}]]], "name": "ResLayer_8_se_average"}, {"class_name": "Reshape", "config": {"target_shape": [1, 1, 96], "trainable": true, "name": "ResLayer_8_reshape"}, "inbound_nodes": [[["ResLayer_8_se_average", 0, 0, {}]]], "name": "ResLayer_8_reshape"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "ResLayer_8_se_compress", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": false, "activity_regularizer": null}, "inbound_nodes": [[["ResLayer_8_reshape", 0, 0, {}]]], "name": "ResLayer_8_se_compress"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "seed": null, "mode": "fan_in"}}, "name": "ResLayer_8_se_gating", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 96, "use_bias": false, "activity_regularizer": null}, "inbound_nodes": [[["ResLayer_8_se_compress", 0, 0, {}]]], "name": "ResLayer_8_se_gating"}, {"class_name": "Permute", "config": {"dims": [3, 1, 2], "trainable": true, "name": "ResLayer_8_se_permute"}, "inbound_nodes": [[["ResLayer_8_se_gating", 0, 0, {}]]], "name": "ResLayer_8_se_permute"}, {"class_name": "Multiply", "config": {"trainable": true, "name": "ResLayer_8_se_scale"}, "inbound_nodes": [[["ResLayer_8_conv2", 0, 0, {}], ["ResLayer_8_se_permute", 0, 0, {}]]], "name": "ResLayer_8_se_scale"}, {"class_name": "Add", "config": {"trainable": true, "name": "ResLayer_8_add"}, "inbound_nodes": [[["ResLayer_7_add", 0, 0, {}], ["ResLayer_8_se_scale", 0, 0, {}]]], "name": "ResLayer_8_add"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_9_bn_1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_8_add", 0, 0, {}]]], "name": "ResLayer_9_bn_1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "ResLayer_9_act_1"}, "inbound_nodes": [[["ResLayer_9_bn_1", 0, 0, {}]]], "name": "ResLayer_9_act_1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_9_conv1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["ResLayer_9_act_1", 0, 0, {}]]], "name": "ResLayer_9_conv1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_9_bn_2", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_9_conv1", 0, 0, {}]]], "name": "ResLayer_9_bn_2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "ResLayer_9_act_2"}, "inbound_nodes": [[["ResLayer_9_bn_2", 0, 0, {}]]], "name": "ResLayer_9_act_2"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_9_conv2", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, 