{"class_name": "Model", "keras_version": "2.1.5", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 5, 13, 13], "name": "inputs_board", "sparse": false}, "inbound_nodes": [], "name": "inputs_board"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "initial-conv", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 80, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["inputs_board", 0, 0, {}]]], "name": "initial-conv"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_0_bn_1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["initial-conv", 0, 0, {}]]], "name": "ResLayer_0_bn_1"}, {"class_name": "Activation", "config": {"activation": "elu", "trainable": true, "name": "ResLayer_0_act_1"}, "inbound_nodes": [[["ResLayer_0_bn_1", 0, 0, {}]]], "name": "ResLayer_0_act_1"}, {"class_name": "Dropout", "config": {"rate": 0.35, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_1"}, "inbound_nodes": [[["ResLayer_0_act_1", 0, 0, {}]]], "name": "dropout_1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_0_conv1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 80, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "ResLayer_0_conv1"}, {"class_name": "Add", "config": {"trainable": true, "name": "ResLayer_0_add"}, "inbound_nodes": [[["initial-conv", 0, 0, {}], ["ResLayer_0_conv1", 0, 0, {}]]], "name": "ResLayer_0_add"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_1_bn_1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_0_add", 0, 0, {}]]], "name": "ResLayer_1_bn_1"}, {"class_name": "Activation", "config": {"activation": "elu", "trainable": true, "name": "ResLayer_1_act_1"}, "inbound_nodes": [[["ResLayer_1_bn_1", 0, 0, {}]]], "name": "ResLayer_1_act_1"}, {"class_name": "Dropout", "config": {"rate": 0.35, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_2"}, "inbound_nodes": [[["ResLayer_1_act_1", 0, 0, {}]]], "name": "dropout_2"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_1_conv1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 80, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "name": "ResLayer_1_conv1"}, {"class_name": "Add", "config": {"trainable": true, "name": "ResLayer_1_add"}, "inbound_nodes": [[["ResLayer_0_add", 0, 0, {}], ["ResLayer_1_conv1", 0, 0, {}]]], "name": "ResLayer_1_add"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_2_bn_1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_1_add", 0, 0, {}]]], "name": "ResLayer_2_bn_1"}, {"class_name": "Activation", "config": {"activation": "elu", "trainable": true, "name": "ResLayer_2_act_1"}, "inbound_nodes": [[["ResLayer_2_bn_1", 0, 0, {}]]], "name": "ResLayer_2_act_1"}, {"class_name": "Dropout", "config": {"rate": 0.35, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_3"}, "inbound_nodes": [[["ResLayer_2_act_1", 0, 0, {}]]], "name": "dropout_3"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_2_conv1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 80, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["dropout_3", 0, 0, {}]]], "name": "ResLayer_2_conv1"}, {"class_name": "Add", "config": {"trainable": true, "name": "ResLayer_2_add"}, "inbound_nodes": [[["ResLayer_1_add", 0, 0, {}], ["ResLayer_2_conv1", 0, 0, {}]]], "name": "ResLayer_2_add"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_3_bn_1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_2_add", 0, 0, {}]]], "name": "ResLayer_3_bn_1"}, {"class_name": "Activation", "config": {"activation": "elu", "trainable": true, "name": "ResLayer_3_act_1"}, "inbound_nodes": [[["ResLayer_3_bn_1", 0, 0, {}]]], "name": "ResLayer_3_act_1"}, {"class_name": "Dropout", "config": {"rate": 0.35, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_4"}, "inbound_nodes": [[["ResLayer_3_act_1", 0, 0, {}]]], "name": "dropout_4"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_3_conv1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 80, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["dropout_4", 0, 0, {}]]], "name": "ResLayer_3_conv1"}, {"class_name": "Add", "config": {"trainable": true, "name": "ResLayer_3_add"}, "inbound_nodes": [[["ResLayer_2_add", 0, 0, {}], ["ResLayer_3_conv1", 0, 0, {}]]], "name": "ResLayer_3_add"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_4_bn_1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_3_add", 0, 0, {}]]], "name": "ResLayer_4_bn_1"}, {"class_name": "Activation", "config": {"activation": "elu", "trainable": true, "name": "ResLayer_4_act_1"}, "inbound_nodes": [[["ResLayer_4_bn_1", 0, 0, {}]]], "name": "ResLayer_4_act_1"}, {"class_name": "Dropout", "config": {"rate": 0.35, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_5"}, "inbound_nodes": [[["ResLayer_4_act_1", 0, 0, {}]]], "name": "dropout_5"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_4_conv1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 80, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["dropout_5", 0, 0, {}]]], "name": "ResLayer_4_conv1"}, {"class_name": "Add", "config": {"trainable": true, "name": "ResLayer_4_add"}, "inbound_nodes": [[["ResLayer_3_add", 0, 0, {}], ["ResLayer_4_conv1", 0, 0, {}]]], "name": "ResLayer_4_add"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_5_bn_1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_4_add", 0, 0, {}]]], "name": "ResLayer_5_bn_1"}, {"class_name": "Activation", "config": {"activation": "elu", "trainable": true, "name": "ResLayer_5_act_1"}, "inbound_nodes": [[["ResLayer_5_bn_1", 0, 0, {}]]], "name": "ResLayer_5_act_1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_5_conv1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 80, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["ResLayer_5_act_1", 0, 0, {}]]], "name": "ResLayer_5_conv1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_5_bn_2", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_5_conv1", 0, 0, {}]]], "name": "ResLayer_5_bn_2"}, {"class_name": "Activation", "config": {"activation": "elu", "trainable": true, "name": "ResLayer_5_act_2"}, "inbound_nodes": [[["ResLayer_5_bn_2", 0, 0, {}]]], "name": "ResLayer_5_act_2"}, {"class_name": "Dropout", "config": {"rate": 0.35, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_6"}, "inbound_nodes": [[["ResLayer_5_act_2", 0, 0, {}]]], "name": "dropout_6"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_5_conv2", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 80, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["dropout_6", 0, 0, {}]]], "name": "ResLayer_5_conv2"}, {"class_name": "Add", "config": {"trainable": true, "name": "ResLayer_5_add"}, "inbound_nodes": [[["ResLayer_4_add", 0, 0, {}], ["ResLayer_5_conv2", 0, 0, {}]]], "name": "ResLayer_5_add"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_6_bn_1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_5_add", 0, 0, {}]]], "name": "ResLayer_6_bn_1"}, {"class_name": "Activation", "config": {"activation": "elu", "trainable": true, "name": "ResLayer_6_act_1"}, "inbound_nodes": [[["ResLayer_6_bn_1", 0, 0, {}]]], "name": "ResLayer_6_act_1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_6_conv1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 80, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["ResLayer_6_act_1", 0, 0, {}]]], "name": "ResLayer_6_conv1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_6_bn_2", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_6_conv1", 0, 0, {}]]], "name": "ResLayer_6_bn_2"}, {"class_name": "Activation", "config": {"activation": "elu", "trainable": true, "name": "ResLayer_6_act_2"}, "inbound_nodes": [[["ResLayer_6_bn_2", 0, 0, {}]]], "name": "ResLayer_6_act_2"}, {"class_name": "Dropout", "config": {"rate": 0.35, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_7"}, "inbound_nodes": [[["ResLayer_6_act_2", 0, 0, {}]]], "name": "dropout_7"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_6_conv2", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 80, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["dropout_7", 0, 0, {}]]], "name": "ResLayer_6_conv2"}, {"class_name": "Add", "config": {"trainable": true, "name": "ResLayer_6_add"}, "inbound_nodes": [[["ResLayer_5_add", 0, 0, {}], ["ResLayer_6_conv2", 0, 0, {}]]], "name": "ResLayer_6_add"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_7_bn_1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_6_add", 0, 0, {}]]], "name": "ResLayer_7_bn_1"}, {"class_name": "Activation", "config": {"activation": "elu", "trainable": true, "name": "ResLayer_7_act_1"}, "inbound_nodes": [[["ResLayer_7_bn_1", 0, 0, {}]]], "name": "ResLayer_7_act_1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_7_conv1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 80, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["ResLayer_7_act_1", 0, 0, {}]]], "name": "ResLayer_7_conv1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_7_bn_2", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_7_conv1", 0, 0, {}]]], "name": "ResLayer_7_bn_2"}, {"class_name": "Activation", "config": {"activation": "elu", "trainable": true, "name": "ResLayer_7_act_2"}, "inbound_nodes": [[["ResLayer_7_bn_2", 0, 0, {}]]], "name": "ResLayer_7_act_2"}, {"class_name": "Dropout", "config": {"rate": 0.35, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_8"}, "inbound_nodes": [[["ResLayer_7_act_2", 0, 0, {}]]], "name": "dropout_8"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_7_conv2", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 80, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["dropout_8", 0, 0, {}]]], "name": "ResLayer_7_conv2"}, {"class_name": "Add", "config": {"trainable": true, "name": "ResLayer_7_add"}, "inbound_nodes": [[["ResLayer_6_add", 0, 0, {}], ["ResLayer_7_conv2", 0, 0, {}]]], "name": "ResLayer_7_add"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_8_bn_1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_7_add", 0, 0, {}]]], "name": "ResLayer_8_bn_1"}, {"class_name": "Activation", "config": {"activation": "elu", "trainable": true, "name": "ResLayer_8_act_1"}, "inbound_nodes": [[["ResLayer_8_bn_1", 0, 0, {}]]], "name": "ResLayer_8_act_1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_8_conv1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 80, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["ResLayer_8_act_1", 0, 0, {}]]], "name": "ResLayer_8_conv1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_8_bn_2", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_8_conv1", 0, 0, {}]]], "name": "ResLayer_8_bn_2"}, {"class_name": "Activation", "config": {"activation": "elu", "trainable": true, "name": "ResLayer_8_act_2"}, "inbound_nodes": [[["ResLayer_8_bn_2", 0, 0, {}]]], "name": "ResLayer_8_act_2"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_8_conv2", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 80, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["ResLayer_8_act_2", 0, 0, {}]]], "name": "ResLayer_8_conv2"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_8_bn_3", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_8_conv2", 0, 0, {}]]], "name": "ResLayer_8_bn_3"}, {"class_name": "Activation", "config": {"activation": "elu", "trainable": true, "name": "ResLayer_8_act_3"}, "inbound_nodes": [[["ResLayer_8_bn_3", 0, 0, {}]]], "name": "ResLayer_8_act_3"}, {"class_name": "Dropout", "config": {"rate": 0.35, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_9"}, "inbound_nodes": [[["ResLayer_8_act_3", 0, 0, {}]]], "name": "dropout_9"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_8_conv3", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 80, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["dropout_9", 0, 0, {}]]], "name": "ResLayer_8_conv3"}, {"class_name": "Add", "config": {"trainable": true, "name": "ResLayer_8_add"}, "inbound_nodes": [[["ResLayer_7_add", 0, 0, {}], ["ResLayer_8_conv3", 0, 0, {}]]], "name": "ResLayer_8_add"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_9_bn_1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_8_add", 0, 0, {}]]], "name": "ResLayer_9_bn_1"}, {"class_name": "Activation", "config": {"activation": "elu", "trainable": true, "name": "ResLayer_9_act_1"}, "inbound_nodes": [[["ResLayer_9_bn_1", 0, 0, {}]]], "name": "ResLayer_9_act_1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_9_conv1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 80, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["ResLayer_9_act_1", 0, 0, {}]]], "name": "ResLayer_9_conv1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_9_bn_2", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_9_conv1", 0, 0, {}]]], "name": "ResLayer_9_bn_2"}, {"class_name": "Activation", "config": {"activation": "elu", "trainable": true, "name": "ResLayer_9_act_2"}, "inbound_nodes": [[["ResLayer_9_bn_2", 0, 0, {}]]], "name": "ResLayer_9_act_2"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_9_conv2", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 80, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["ResLayer_9_act_2", 0, 0, {}]]], "name": "ResLayer_9_conv2"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_9_bn_3", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_9_conv2", 0, 0, {}]]], "name": "ResLayer_9_bn_3"}, {"class_name": "Activation", "config": {"activation": "elu", "trainable": true, "name": "ResLayer_9_act_3"}, "inbound_nodes": [[["ResLayer_9_bn_3", 0, 0, {}]]], "name": "ResLayer_9_act_3"}, {"class_name": "Dropout", "config": {"rate": 0.35, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_10"}, "inbound_nodes": [[["ResLayer_9_act_3", 0, 0, {}]]], "name": "dropout_10"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_9_conv3", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 80, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["dropout_10", 0, 0, {}]]], "name": "ResLayer_9_conv3"}, {"class_name": "Add", "config": {"trainable": true, "name": "ResLayer_9_add"}, "inbound_nodes": [[["ResLayer_8_add", 0, 0, {}], ["ResLayer_9_conv3", 0, 0, {}]]], "name": "ResLayer_9_add"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_10_bn_1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_9_add", 0, 0, {}]]], "name": "ResLayer_10_bn_1"}, {"class_name": "Activation", "config": {"activation": "elu", "trainable": true, "name": "ResLayer_10_act_1"}, "inbound_nodes": [[["ResLayer_10_bn_1", 0, 0, {}]]], "name": "ResLayer_10_act_1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_10_conv1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 80, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["ResLayer_10_act_1", 0, 0, {}]]], "name": "ResLayer_10_conv1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_10_bn_2", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_10_conv1", 0, 0, {}]]], "name": "ResLayer_10_bn_2"}, {"class_name": "Activation", "config": {"activation": "elu", "trainable": true, "name": "ResLayer_10_act_2"}, "inbound_nodes": [[["ResLayer_10_bn_2", 0, 0, {}]]], "name": "ResLayer_10_act_2"}, {"class_name": "Dropout", "config": {"rate": 0.35, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_11"}, "inbound_nodes": [[["ResLayer_10_act_2", 0, 0, {}]]], "name": "dropout_11"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_10_conv2", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 80, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["dropout_11", 0, 0, {}]]], "name": "ResLayer_10_conv2"}, {"class_name": "Add", "config": {"trainable": true, "name": "ResLayer_10_add"}, "inbound_nodes": [[["ResLayer_9_add", 0, 0, {}], ["ResLayer_10_conv2", 0, 0, {}]]], "name": "ResLayer_10_add"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_11_bn_1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_10_add", 0, 0, {}]]], "name": "ResLayer_11_bn_1"}, {"class_name": "Activation", "config": {"activation": "elu", "trainable": true, "name": "ResLayer_11_act_1"}, "inbound_nodes": [[["ResLayer_11_bn_1", 0, 0, {}]]], "name": "ResLayer_11_act_1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_11_conv1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 80, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["ResLayer_11_act_1", 0, 0, {}]]], "name": "ResLayer_11_conv1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_11_bn_2", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_11_conv1", 0, 0, {}]]], "name": "ResLayer_11_bn_2"}, {"class_name": "Activation", "config": {"activation": "elu", "trainable": true, "name": "ResLayer_11_act_2"}, "inbound_nodes": [[["ResLayer_11_bn_2", 0, 0, {}]]], "name": "ResLayer_11_act_2"}, {"class_name": "Dropout", "config": {"rate": 0.35, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_12"}, "inbound_nodes": [[["ResLayer_11_act_2", 0, 0, {}]]], "name": "dropout_12"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_11_conv2", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 80, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["dropout_12", 0, 0, {}]]], "name": "ResLayer_11_conv2"}, {"class_name": "Add", "config": {"trainable": true, "name": "ResLayer_11_add"}, "inbound_nodes": [[["ResLayer_10_add", 0, 0, {}], ["ResLayer_11_conv2", 0, 0, {}]]], "name": "ResLayer_11_add"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_12_bn_1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_11_add", 0, 0, {}]]], "name": "ResLayer_12_bn_1"}, {"class_name": "Activation", "config": {"activation": "elu", "trainable": true, "name": "ResLayer_12_act_1"}, "inbound_nodes": [[["ResLayer_12_bn_1", 0, 0, {}]]], "name": "ResLayer_12_act_1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_12_conv1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 80, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["ResLayer_12_act_1", 0, 0, {}]]], "name": "ResLayer_12_conv1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_12_bn_2", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_12_conv1", 0, 0, {}]]], "name": "ResLayer_12_bn_2"}, {"class_name": "Activation", "config": {"activation": "elu", "trainable": true, "name": "ResLayer_12_act_2"}, "inbound_nodes": [[["ResLayer_12_bn_2", 0, 0, {}]]], "name": "ResLayer_12_act_2"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_12_conv2", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 80, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["ResLayer_12_act_2", 0, 0, {}]]], "name": "ResLayer_12_conv2"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_12_bn_3", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_12_conv2", 0, 0, {}]]], "name": "ResLayer_12_bn_3"}, {"class_name": "Activation", "config": {"activation": "elu", "trainable": true, "name": "ResLayer_12_act_3"}, "inbound_nodes": [[["ResLayer_12_bn_3", 0, 0, {}]]], "name": "ResLayer_12_act_3"}, {"class_name": "Dropout", "config": {"rate": 0.35, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_13"}, "inbound_nodes": [[["ResLayer_12_act_3", 0, 0, {}]]], "name": "dropout_13"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_12_conv3", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 80, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["dropout_13", 0, 0, {}]]], "name": "ResLayer_12_conv3"}, {"class_name": "Add", "config": {"trainable": true, "name": "ResLayer_12_add"}, "inbound_nodes": [[["ResLayer_11_add", 0, 0, {}], ["ResLayer_12_conv3", 0, 0, {}]]], "name": "ResLayer_12_add"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_13_bn_1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_12_add", 0, 0, {}]]], "name": "ResLayer_13_bn_1"}, {"class_name": "Activation", "config": {"activation": "elu", "trainable": true, "name": "ResLayer_13_act_1"}, "inbound_nodes": [[["ResLayer_13_bn_1", 0, 0, {}]]], "name": "ResLayer_13_act_1"}, {"class_name": "Dropout", "config": {"rate": 0.35, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_14"}, "inbound_nodes": [[["ResLayer_13_act_1", 0, 0, {}]]], "name": "dropout_14"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_13_conv1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 80, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["dropout_14", 0, 0, {}]]], "name": "ResLayer_13_conv1"}, {"class_name": "Add", "config": {"trainable": true, "name": "ResLayer_13_add"}, "inbound_nodes": [[["ResLayer_12_add", 0, 0, {}], ["ResLayer_13_conv1", 0, 0, {}]]], "name": "ResLayer_13_add"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_14_bn_1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_13_add", 0, 0, {}]]], "name": "ResLayer_14_bn_1"}, {"class_name": "Activation", "config": {"activation": "elu", "trainable": true, "name": "ResLayer_14_act_1"}, "inbound_nodes": [[["ResLayer_14_bn_1", 0, 0, {}]]], "name": "ResLayer_14_act_1"}, {"class_name": "Dropout", "config": {"rate": 0.35, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_15"}, "inbound_nodes": [[["ResLayer_14_act_1", 0, 0, {}]]], "name": "dropout_15"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_14_conv1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 80, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["dropout_15", 0, 0, {}]]], "name": "ResLayer_14_conv1"}, {"class_name": "Add", "config": {"trainable": true, "name": "ResLayer_14_add"}, "inbound_nodes": [[["ResLayer_13_add", 0, 0, {}], ["ResLayer_14_conv1", 0, 0, {}]]], "name": "ResLayer_14_add"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_15_bn_1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_14_add", 0, 0, {}]]], "name": "ResLayer_15_bn_1"}, {"class_name": "Activation", "config": {"activation": "elu", "trainable": true, "name": "ResLayer_15_act_1"}, "inbound_nodes": [[["ResLayer_15_bn_1", 0, 0, {}]]], "name": "ResLayer_15_act_1"}, {"class_name": "Dropout", "config": {"rate": 0.35, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_16"}, "inbound_nodes": [[["ResLayer_15_act_1", 0, 0, {}]]], "name": "dropout_16"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_15_conv1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 80, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["dropout_16", 0, 0, {}]]], "name": "ResLayer_15_conv1"}, {"class_name": "Add", "config": {"trainable": true, "name": "ResLayer_15_add"}, "inbound_nodes": [[["ResLayer_14_add", 0, 0, {}], ["ResLayer_15_conv1", 0, 0, {}]]], "name": "ResLayer_15_add"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_16_bn_1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_15_add", 0, 0, {}]]], "name": "ResLayer_16_bn_1"}, {"class_name": "Activation", "config": {"activation": "elu", "trainable": true, "name": "ResLayer_16_act_1"}, "inbound_nodes": [[["ResLayer_16_bn_1", 0, 0, {}]]], "name": "ResLayer_16_act_1"}, {"class_name": "Dropout", "config": {"rate": 0.35, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_17"}, "inbound_nodes": [[["ResLayer_16_act_1", 0, 0, {}]]], "name": "dropout_17"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_16_conv1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 80, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["dropout_17", 0, 0, {}]]], "name": "ResLayer_16_conv1"}, {"class_name": "Add", "config": {"trainable": true, "name": "ResLayer_16_add"}, "inbound_nodes": [[["ResLayer_15_add", 0, 0, {}], ["ResLayer_16_conv1", 0, 0, {}]]], "name": "ResLayer_16_add"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_17_bn_1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_16_add", 0, 0, {}]]], "name": "ResLayer_17_bn_1"}, {"class_name": "Activation", "config": {"activation": "elu", "trainable": true, "name": "ResLayer_17_act_1"}, "inbound_nodes": [[["ResLayer_17_bn_1", 0, 0, {}]]], "name": "ResLayer_17_act_1"}, {"class_name": "Dropout", "config": {"rate": 0.35, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_18"}, 