{"class_name": "Model", "keras_version": "2.1.6", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 5, 8, 8], "name": "inputs_board", "sparse": false}, "inbound_nodes": [], "name": "inputs_board"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "initial-conv_conv2d", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["inputs_board", 0, 0, {}]]], "name": "initial-conv_conv2d"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "initial-conv_bn", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["initial-conv_conv2d", 0, 0, {}]]], "name": "initial-conv_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "initial-conv_relu"}, "inbound_nodes": [[["initial-conv_bn", 0, 0, {}]]], "name": "initial-conv_relu"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_0_conv0", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["initial-conv_relu", 0, 0, {}]]], "name": "ResLayer_0_conv0"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_0_bn0", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_0_conv0", 0, 0, {}]]], "name": "ResLayer_0_bn0"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "ResLayer_0_act0"}, "inbound_nodes": [[["ResLayer_0_bn0", 0, 0, {}]]], "name": "ResLayer_0_act0"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_0_conv1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["ResLayer_0_act0", 0, 0, {}]]], "name": "ResLayer_0_conv1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_0_bn1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_0_conv1", 0, 0, {}]]], "name": "ResLayer_0_bn1"}, {"class_name": "Add", "config": {"trainable": true, "name": "ResLayer_0_add"}, "inbound_nodes": [[["initial-conv_relu", 0, 0, {}], ["ResLayer_0_bn1", 0, 0, {}]]], "name": "ResLayer_0_add"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "ResLayer_0_act_add"}, "inbound_nodes": [[["ResLayer_0_add", 0, 0, {}]]], "name": "ResLayer_0_act_add"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_1_conv0", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["ResLayer_0_act_add", 0, 0, {}]]], "name": "ResLayer_1_conv0"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_1_bn0", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_1_conv0", 0, 0, {}]]], "name": "ResLayer_1_bn0"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "ResLayer_1_act0"}, "inbound_nodes": [[["ResLayer_1_bn0", 0, 0, {}]]], "name": "ResLayer_1_act0"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_1_conv1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["ResLayer_1_act0", 0, 0, {}]]], "name": "ResLayer_1_conv1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_1_bn1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_1_conv1", 0, 0, {}]]], "name": "ResLayer_1_bn1"}, {"class_name": "Add", "config": {"trainable": true, "name": "ResLayer_1_add"}, "inbound_nodes": [[["ResLayer_0_act_add", 0, 0, {}], ["ResLayer_1_bn1", 0, 0, {}]]], "name": "ResLayer_1_add"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "ResLayer_1_act_add"}, "inbound_nodes": [[["ResLayer_1_add", 0, 0, {}]]], "name": "ResLayer_1_act_add"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_2_conv0", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["ResLayer_1_act_add", 0, 0, {}]]], "name": "ResLayer_2_conv0"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_2_bn0", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_2_conv0", 0, 0, {}]]], "name": "ResLayer_2_bn0"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "ResLayer_2_act0"}, "inbound_nodes": [[["ResLayer_2_bn0", 0, 0, {}]]], "name": "ResLayer_2_act0"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_2_conv1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["ResLayer_2_act0", 0, 0, {}]]], "name": "ResLayer_2_conv1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_2_bn1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_2_conv1", 0, 0, {}]]], "name": "ResLayer_2_bn1"}, {"class_name": "Add", "config": {"trainable": true, "name": "ResLayer_2_add"}, "inbound_nodes": [[["ResLayer_1_act_add", 0, 0, {}], ["ResLayer_2_bn1", 0, 0, {}]]], "name": "ResLayer_2_add"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "ResLayer_2_act_add"}, "inbound_nodes": [[["ResLayer_2_add", 0, 0, {}]]], "name": "ResLayer_2_act_add"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_3_conv0", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["ResLayer_2_act_add", 0, 0, {}]]], "name": "ResLayer_3_conv0"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_3_bn0", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_3_conv0", 0, 0, {}]]], "name": "ResLayer_3_bn0"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "ResLayer_3_act0"}, "inbound_nodes": [[["ResLayer_3_bn0", 0, 0, {}]]], "name": "ResLayer_3_act0"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_3_conv1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["ResLayer_3_act0", 0, 0, {}]]], "name": "ResLayer_3_conv1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_3_bn1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_3_conv1", 0, 0, {}]]], "name": "ResLayer_3_bn1"}, {"class_name": "Add", "config": {"trainable": true, "name": "ResLayer_3_add"}, "inbound_nodes": [[["ResLayer_2_act_add", 0, 0, {}], ["ResLayer_3_bn1", 0, 0, {}]]], "name": "ResLayer_3_add"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "ResLayer_3_act_add"}, "inbound_nodes": [[["ResLayer_3_add", 0, 0, {}]]], "name": "ResLayer_3_act_add"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_4_conv0", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["ResLayer_3_act_add", 0, 0, {}]]], "name": "ResLayer_4_conv0"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_4_bn0", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_4_conv0", 0, 0, {}]]], "name": "ResLayer_4_bn0"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "ResLayer_4_act0"}, "inbound_nodes": [[["ResLayer_4_bn0", 0, 0, {}]]], "name": "ResLayer_4_act0"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_4_conv1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["ResLayer_4_act0", 0, 0, {}]]], "name": "ResLayer_4_conv1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_4_bn1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_4_conv1", 0, 0, {}]]], "name": "ResLayer_4_bn1"}, {"class_name": "Add", "config": {"trainable": true, "name": "ResLayer_4_add"}, "inbound_nodes": [[["ResLayer_3_act_add", 0, 0, {}], ["ResLayer_4_bn1", 0, 0, {}]]], "name": "ResLayer_4_add"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "ResLayer_4_act_add"}, "inbound_nodes": [[["ResLayer_4_add", 0, 0, {}]]], "name": "ResLayer_4_act_add"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_5_conv0", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["ResLayer_4_act_add", 0, 0, {}]]], "name": "ResLayer_5_conv0"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_5_bn0", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_5_conv0", 0, 0, {}]]], "name": "ResLayer_5_bn0"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "ResLayer_5_act0"}, "inbound_nodes": [[["ResLayer_5_bn0", 0, 0, {}]]], "name": "ResLayer_5_act0"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_5_conv1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["ResLayer_5_act0", 0, 0, {}]]], "name": "ResLayer_5_conv1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_5_bn1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_5_conv1", 0, 0, {}]]], "name": "ResLayer_5_bn1"}, {"class_name": "Add", "config": {"trainable": true, "name": "ResLayer_5_add"}, "inbound_nodes": [[["ResLayer_4_act_add", 0, 0, {}], ["ResLayer_5_bn1", 0, 0, {}]]], "name": "ResLayer_5_add"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "ResLayer_5_act_add"}, "inbound_nodes": [[["ResLayer_5_add", 0, 0, {}]]], "name": "ResLayer_5_act_add"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_6_conv0", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["ResLayer_5_act_add", 0, 0, {}]]], "name": "ResLayer_6_conv0"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_6_bn0", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_6_conv0", 0, 0, {}]]], "name": "ResLayer_6_bn0"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "ResLayer_6_act0"}, "inbound_nodes": [[["ResLayer_6_bn0", 0, 0, {}]]], "name": "ResLayer_6_act0"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_6_conv1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["ResLayer_6_act0", 0, 0, {}]]], "name": "ResLayer_6_conv1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_6_bn1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_6_conv1", 0, 0, {}]]], "name": "ResLayer_6_bn1"}, {"class_name": "Add", "config": {"trainable": true, "name": "ResLayer_6_add"}, "inbound_nodes": [[["ResLayer_5_act_add", 0, 0, {}], ["ResLayer_6_bn1", 0, 0, {}]]], "name": "ResLayer_6_add"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "ResLayer_6_act_add"}, "inbound_nodes": [[["ResLayer_6_add", 0, 0, {}]]], "name": "ResLayer_6_act_add"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_7_conv0", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["ResLayer_6_act_add", 0, 0, {}]]], "name": "ResLayer_7_conv0"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_7_bn0", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_7_conv0", 0, 0, {}]]], "name": "ResLayer_7_bn0"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "ResLayer_7_act0"}, "inbound_nodes": [[["ResLayer_7_bn0", 0, 0, {}]]], "name": "ResLayer_7_act0"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_7_conv1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["ResLayer_7_act0", 0, 0, {}]]], "name": "ResLayer_7_conv1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_7_bn1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_7_conv1", 0, 0, {}]]], "name": "ResLayer_7_bn1"}, {"class_name": "Add", "config": {"trainable": true, "name": "ResLayer_7_add"}, "inbound_nodes": [[["ResLayer_6_act_add", 0, 0, {}], ["ResLayer_7_bn1", 0, 0, {}]]], "name": "ResLayer_7_add"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "ResLayer_7_act_add"}, "inbound_nodes": [[["ResLayer_7_add", 0, 0, {}]]], "name": "ResLayer_7_act_add"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_8_conv0", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["ResLayer_7_act_add", 0, 0, {}]]], "name": "ResLayer_8_conv0"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_8_bn0", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_8_conv0", 0, 0, {}]]], "name": "ResLayer_8_bn0"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "ResLayer_8_act0"}, "inbound_nodes": [[["ResLayer_8_bn0", 0, 0, {}]]], "name": "ResLayer_8_act0"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_8_conv1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["ResLayer_8_act0", 0, 0, {}]]], "name": "ResLayer_8_conv1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_8_bn1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_8_conv1", 0, 0, {}]]], "name": "ResLayer_8_bn1"}, {"class_name": "Add", "config": {"trainable": true, "name": "ResLayer_8_add"}, "inbound_nodes": [[["ResLayer_7_act_add", 0, 0, {}], ["ResLayer_8_bn1", 0, 0, {}]]], "name": "ResLayer_8_add"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "ResLayer_8_act_add"}, "inbound_nodes": [[["ResLayer_8_add", 0, 0, {}]]], "name": "ResLayer_8_act_add"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_9_conv0", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["ResLayer_8_act_add", 0, 0, {}]]], "name": "ResLayer_9_conv0"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_9_bn0", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_9_conv0", 0, 0, {}]]], "name": "ResLayer_9_bn0"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "ResLayer_9_act0"}, "inbound_nodes": [[["ResLayer_9_bn0", 0, 0, {}]]], "name": "ResLayer_9_act0"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_9_conv1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["ResLayer_9_act0", 0, 0, {}]]], "name": "ResLayer_9_conv1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_9_bn1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_9_conv1", 0, 0, {}]]], "name": "ResLayer_9_bn1"}, {"class_name": "Add", "config": {"trainable": true, "name": "ResLayer_9_add"}, "inbound_nodes": [[["ResLayer_8_act_add", 0, 0, {}], ["ResLayer_9_bn1", 0, 0, {}]]], "name": "ResLayer_9_add"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "ResLayer_9_act_add"}, "inbound_nodes": [[["ResLayer_9_add", 0, 0, {}]]], "name": "ResLayer_9_act_add"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_10_conv0", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["ResLayer_9_act_add", 0, 0, {}]]], "name": "ResLayer_10_conv0"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_10_bn0", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_10_conv0", 0, 0, {}]]], "name": "ResLayer_10_bn0"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "ResLayer_10_act0"}, "inbound_nodes": [[["ResLayer_10_bn0", 0, 0, {}]]], "name": "ResLayer_10_act0"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_10_conv1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["ResLayer_10_act0", 0, 0, {}]]], "name": "ResLayer_10_conv1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_10_bn1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_10_conv1", 0, 0, {}]]], "name": "ResLayer_10_bn1"}, {"class_name": "Add", "config": {"trainable": true, "name": "ResLayer_10_add"}, "inbound_nodes": [[["ResLayer_9_act_add", 0, 0, {}], ["ResLayer_10_bn1", 0, 0, {}]]], "name": "ResLayer_10_add"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "ResLayer_10_act_add"}, "inbound_nodes": [[["ResLayer_10_add", 0, 0, {}]]], "name": "ResLayer_10_act_add"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_11_conv0", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["ResLayer_10_act_add", 0, 0, {}]]], "name": "ResLayer_11_conv0"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_11_bn0", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_11_conv0", 0, 0, {}]]], "name": "ResLayer_11_bn0"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "ResLayer_11_act0"}, "inbound_nodes": [[["ResLayer_11_bn0", 0, 0, {}]]], "name": "ResLayer_11_act0"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "ResLayer_11_conv1", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "inbound_nodes": [[["ResLayer_11_act0", 0, 0, {}]]], "name": "ResLayer_11_conv1"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "ResLayer_11_bn1", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["ResLayer_11_conv1", 0, 0, {}]]], "name": "ResLayer_11_bn1"}, {"class_name": "Add", "config": {"trainable": true, "name": "ResLayer_11_add"}, "inbound_nodes": [[["ResLayer_10_act_add", 0, 0, {}], ["ResLayer_11_bn1", 0, 0, {}]]], "name": "ResLayer_11_add"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "ResLayer_11_act_add"}, "inbound_nodes": [[["ResLayer_11_add", 0, 0, {}]]], "name": "ResLayer_11_act_add"}, {"class_name": "GlobalAveragePooling2D", "config": {"trainable": true, "name": "value_average", "data_format": "channels_first"}, "inbound_nodes": [[["ResLayer_11_act_add", 0, 0, {}]]], "name": "value_average"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "value_flatten_conv2d", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["ResLayer_11_act_add", 0, 0, {}]]], "name": "value_flatten_conv2d"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "to_flatten_policy_head_0_conv2d", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 2, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["ResLayer_11_act_add", 0, 0, {}]]], "name": "to_flatten_policy_head_0_conv2d"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "to_flatten_policy_head_1_conv2d", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_first", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 2, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "inbound_nodes": [[["ResLayer_11_act_add", 0, 0, {}]]], "name": "to_flatten_policy_head_1_conv2d"}, {"class_name": "Reshape", "config": {"target_shape": [1, 1, 96], "trainable": true, "name": "value_reshape"}, "inbound_nodes": [[["value_average", 0, 0, {}]]], "name": "value_reshape"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "value_flatten_relu"}, "inbound_nodes": [[["value_flatten_conv2d", 0, 0, {}]]], "name": "value_flatten_relu"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "to_flatten_policy_head_0_bn", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["to_flatten_policy_head_0_conv2d", 0, 0, {}]]], "name": "to_flatten_policy_head_0_bn"}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "to_flatten_policy_head_1_bn", "epsilon": 0.001, "trainable": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "axis": 1, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "center": true}, "inbound_nodes": [[["to_flatten_policy_head_1_conv2d", 0, 0, {}]]], "name": "to_flatten_policy_head_1_bn"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_3", "data_format": "channels_last"}, "inbound_nodes": [[["value_reshape", 0, 0, {}]]], "name": "flatten_3"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_4", "data_format": "channels_last"}, "inbound_nodes": [[["value_flatten_relu", 0, 0, {}]]], "name": "flatten_4"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "to_flatten_policy_head_0_relu"}, "inbound_nodes": [[["to_flatten_policy_head_0_bn", 0, 0, {}]]], "name": "to_flatten_policy_head_0_relu"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "to_flatten_policy_head_1_relu"}, "inbound_nodes": [[["to_flatten_policy_head_1_bn", 0, 0, {}]]], "name": "to_flatten_policy_head_1_relu"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_1", "axis": -1}, "inbound_nodes": [[["flatten_3", 0, 0, {}], ["flatten_4", 0, 0, {}]]], "name": "concatenate_1"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}, "inbound_nodes": [[["to_flatten_policy_head_0_relu", 0, 0, {}]]], "name": "flatten_1"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_2", "data_format": "channels_last"}, "inbound_nodes": [[["to_flatten_policy_head_1_relu", 0, 0, {}]]], "name": "flatten_2"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "value_hidden", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 1.9999999494757503e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 512, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "name": "value_hidden"}, {"class_name": "Dropout", "config": {"rate": 0.25, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_1"}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "name": "dropout_1"}, {"class_name": "Dropout", "config": {"rate": 0.25, "noise_shape": null, "trainable": true, "seed": null, "name": "dropout_2"}, "inbound_nodes": [[["flatten_2", 0, 0, {}]]], "name": "dropout_2"}, {"class_name": "Lambda", "config": {"function": ["YwEAAAADAAAABwAAAENAAABzbAAAAHwAAHQAAGoBAHwAAGQBAGQCAGQDAHQCAIMBAjh9AAB0AABq\nAwB8AABkAQBkAgCDAQF9AAB0AABqBAB8AACDAQB9AQB0AABqBAB8AAALgwEAfQIAdAAAagUAfAEA\nfAIAZwIAZAEAZAIAgwEBUygEAAAATnQEAAAAYXhpc2kBAAAAdAgAAABrZWVwZGltcygGAAAAdAEA\nAABLdAQAAABtZWFudAQAAABUcnVldAwAAABsMl9ub3JtYWxpemV0BAAAAHJlbHV0CwAAAGNvbmNh\ndGVuYXRlKAMAAAB0BgAAAGlucHV0c3QDAAAAcG9zdAMAAABuZWcoAAAAACgAAAAAczMAAAAvaG9t\nZS9yeGUvd29ya2luZy9nZ3B6ZXJvL3NyYy9nZ3B6ZXJvL3V0aWwva2VyYXMucHl0DQAAAGFudGly\nZWN0aWZpZXIbAAAAcwoAAAAAAR8BFQEPARAB\n", null, null], "name": "value_hidden_act", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["value_hidden", 0, 0, {}]]], "name": "value_hidden_act"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "policy_0", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "softmax", "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 1.9999999494757503e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 155, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "policy_0"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "policy_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "softmax", "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 1.9999999494757503e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 155, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "name": "policy_1"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "value", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 1.9999999494757503e-05, "l1": 0.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["value_hidden_act", 0, 0, {}]]], "name": "value"}], "input_layers": [["inputs_board", 0, 0]], "output_layers": [["policy_0", 0, 0], ["policy_1", 0, 0], ["value", 0, 0]], "name": "model_1"}, "backend": "tensorflow"}